app/controllers/bookings_controller.rb

  def create
    @booking = Booking.new(params[:booking])

    respond_to do |format|
      if @booking.save
---
INSERT INTO "bookings" ("created_at", "end", "guest_id", "num_people", "people_id", "start", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)