app/controllers/people_controller.rb

SELECT "people".* FROM "people"
---
  def index
    if @booking
      @people = @booking.people
    else
      @people = Person.all